import { describe, expect, it } from 'bun:test';
import { findMatches } from './fuzzy.js';

describe('fuzzy', () => {
    describe('findMatches', () => {
        it('should match it', () => {
            const pages = [
                'قلت: ما أعتقد أن ابن لهيعة رواه.\nقتيبة، حدثنا ابن لهيعة، عن عطاء، عن ابن عباس - أن رسول الله صلى الله عليه وسلم قال: ما من قوم يغدو عليهم ويروح عشرون عنزا أسود فيخافون العالة.\nوبإسناد مظلم من حديث ابن لهيعة، وكأن الآفة من بعد عن محمد بن عبد الرحمن ابن نوفل، عن عامر بن عبد الله بن الزبير، عن أبيه، عن علي - مرفوعا: الهم نصف الهرم، وقلة العيال أحد اليسارين - في حديث طويل منه ألفاظ في الشهاب للقضاعى.\nأخبرنا أبو المعالى الابرقوهى، أخبرنا أبو الفرج الكاتب، أخبرنا الارموى، وابن الداية، ومحمد بن أحمد الطرائفي، قالوا: أخبرنا أبو جعفر بن المسلمة، أخبرنا أبو الفضل [الكاتب] الزهري سنة ثمان وثلثمائة، أخبرنا جعفر الفريابي سنة ثمان وتسعين ومائتين، حدثنا قتيبة، حدثنا ابن لهيعة، قال الفريابي: وحدثنا هشام بن عمار، حدثنا أسد ابن موسى، حدثنا ابن لهيعة، عن الحارث بن يزيد، عن علي بن رباح، عن عبد الله ابن عمرو، قال: كان النفاق غريبا في الايمان، ويوشك أن يكون الايمان غريبا في النفاق.\n(١ [ثقتان، قال: حدثنا إبراهيم بن الهيثم، حدثنا عمرو بن خالد، حدثنا ابن لهيعة، عن بكير بن الاشج، عن نافع، عن ابن عمر - أن النبي صلى الله عليه وسلم قال: من يسافر من دار إقامة يوم الجمعة دعت عليه الملائكة، لا يصحب في سفره ولا يعان على حاجته] ١) .\nعثمان بن صالح، عن ابن لهيعة، عن عطاء، عن ابن عباس، عن النبي صلى الله عليه وسلم، قال: عمر منى، وأنا من عمر، والحق بعدى مع عمر.\nمنصور بن عمار، حدثنا ابن لهيعة، عن عمرو بن شعيب، عن أبيه، عن جده - مرفوعا: من توضأ في موضع بوله فأصابه الوسواس فلا يلومن إلا نفسه.\nمحمد بن معاوية النيسابوري، أخبرنا ابن لهيعة، عن عمرو، عن أبيه، عن جده - رفعه إذا رأيتم الحريق فكبروا، فإن ذلك يطفئه.\nقال ابن حبان: مولد ابن لهيعة سنة ست وتسعين، ومات سنة أربع وسبعين ومائة.\nوكان صالحا، لكنه يدلس عن الضعفاء، ثم احترقت كتبه، وكان أصحابنا يقولون: سماع من سمع منه قبل احتراق كتبه مثل العبادلة: عبد الله بن وهب، وابن المبارك، وعبد الله بن يزيد المقرئ، وعبد الله بن مسلمة القعنبي - فسماعهم صحيح.\nوكان ابن لهيعة من الكتابين للحديث والجماعين للعلم والرحالين فيه، ولقد حدثني شكر، حدثنا يوسف بن سعيد بن مسلم، عن بشر بن المنذر، قال: كان ابن لهيعة يكنى أبا خريطة، وذلك أنه كانت له خريط معلقة في عنقه، وكان يدور بمصر، فكلما قدم قوم كان يدور عليهم ويسألهم.\nقال ابن حبان: قد سبرت أخباره في رواية المتقدمين والمتأخرين عنه فرأيت [٧٤ / ٣] التخليط في رواية المتأخر عنه موجودا وما لا أصل له / في رواية المتقدمين كثيرا، فرجعت إلى الاعتبار فرأيته كان يدلس عن أقوام ضعفى على أقوام رآهم ابن لهيعة ثقات، فألزق تلك الموضوعات بهم.\nحرملة، حدثنا ابن وهب، عن ابن لهيعة، عن عبيد الله بن أبي جعفر، عن نافع، عن ابن عمر - أن رسول الله صلى الله عليه وسلم قال: من خرج من الجماعة قيد شبر فقد خلع ربقة الإسلام عن عنقه حتى يراجعها.\nوحدثنا أبو يعلى، حدثنا كامل بن طلحة، حدثنا ابن لهيعة، حدثني يحيى بن عبد الله المعافرى، عن أبي عبد الرحمن الحبلى، عن عبد الله بن عمرو - أن رسول الله صلى الله عليه وسلم قال في مرضه: ادعوا لي أخي، فدعى أبو بكر فأعرض عنه، ثم قال: ادعوا لي أخي، فدعى له عثمان، فأعرض عنه، ثم دعى له علي فستره بثوبه وأكب',
                'عليه، فلما خرج من عنده قيل له: ما قال لك؟ قال: علمني ألف باب كل باب يفتح ألف باب.\nقلت: كامل صدوق.\nوقال ابن عدي: لعل البلاء فيه من ابن لهيعة، فإنه مفرط في التشيع.\nوقال البخاري في كتاب الضعفاء في ذكر ابن لهعية تعليقا: الجعفي، حدثنا المقرئ، حدثنا ابن لهيعة، حدثني أبو طعمة، قال: كنت عند ابن عمر إذ جاءه فسأله عن صيام رمضان في السفر، قال: أفطر، فقال الرجل: أجدني أقوى، فأعاد عليه ثلاثا، ثم قال ابن عمر: سمعت رسول الله صلى الله عليه وسلم يقول: من لم يقبل رخصة الله فعليه من الاثم مثل جبال عرفات.\nقال البخاري: هذا منكر، ثم قال البخاري: حدثني أحمد بن عبد الله، أخبرنا صدقة بن عبد الرحمن، حدثنا ابن لهيعة، عن مشرح بن هاعان، عن عقبة بن عامر، سمعت رسول الله صلى الله عليه وسلم يقول: لو تمت البقرة ثلاثمائة آية لتكلمت.',
            ];

            const excerpts = [
                'محمد بن معاوية النيسابوري، أخبرنا ابن لهيعة، عن عمرو، عن أبيه، عن جده - رفعه إذا رأيتم الحريق فكبروا، فإن ذلك يطفئه.\nقال ابن حبان: مولد ابن لهيعة سنة ست وتسعين، ومات سنة أربع وسبعين ومائة.\nوكان صالحا، لكنه يدلس عن الضعفاء، ثم احترقت كتبه، وكان أصحابنا يقولون: سماع من سمع منه قبل احتراق كتبه مثل العبادلة: عبد الله بن وهب، وابن المبارك، وعبد الله بن يزيد المقرئ، وعبد الله بن مسلمة القعنبي - فسماعهم صحيح.\nوكان ابن لهيعة من الكتابين للحديث والجماعين للعلم والرحالين فيه، ولقد حدثني شكر، حدثنا يوسف بن سعيد بن مسلم، عن بشر بن المنذر، قال: كان ابن لهيعة يكنى أبا خريطة، وذلك أنه كانت له خريط معلقة في عنقه، وكان يدور بمصر، فكلما قدم قوم كان يدور عليهم ويسألهم.\nقال ابن حبان: قد سبرت أخباره في رواية المتقدمين والمتأخرين عنه فرأيت [74/3] التخليط في رواية المتأخر عنه موجودا وما لا أصل له / في رواية المتقدمين كثيرا، فرجعت إلى الاعتبار فرأيته كان يدلس عن أقوام ضعفى على أقوام رآهم ابن لهيعة ثقات، فألزق تلك الموضوعات بهم.\nحرملة، حدثنا ابن وهب، عن ابن لهيعة، عن عبيد الله بن أبي جعفر، عن نافع، عن ابن عمر - أن رسول الله صلى الله عليه وسلم قال: من خرج من الجماعة قيد شبر فقد خلع ربقة الإسلام عن عنقه حتى يراجعها.\nوحدثنا أبو يعلى، حدثنا كامل بن طلحة، حدثنا ابن لهيعة، حدثني يحيى بن عبد الله المعافرى، عن أبي عبد الرحمن الحبلى، عن عبد الله بن عمرو - أن رسول الله صلى الله عليه وسلم قال في مرضه: ادعوا لي أخي، فدعى أبو بكر فأعرض عنه، ثم قال: ادعوا لي أخي، فدعى له عثمان، فأعرض عنه، ثم دعى له علي فستره بثوبه وأكب عليه، فلما خرج من عنده قيل له: ما قال لك؟ قال: علمني ألف باب كل باب يفتح ألف باب.\nقلت: كامل صدوق.\nوقال ابن عدي: لعل البلاء فيه من ابن لهيعة، فإنه مفرط في التشيع.\nوقال البخاري في كتاب الضعفاء في ذكر ابن لهعية تعليقا: الجعفي، حدثنا المقرئ، حدثنا ابن لهيعة، حدثني أبو طعمة، قال: كنت عند ابن عمر إذ جاءه فسأله عن صيام رمضان في السفر، قال: أفطر، فقال الرجل: أجدني أقوى، فأعاد عليه ثلاثا، ثم قال ابن عمر: سمعت رسول الله صلى الله عليه وسلم يقول: من لم يقبل رخصة الله فعليه من الاثم مثل جبال عرفات.\nقال البخاري: هذا منكر، ثم قال البخاري: حدثني أحمد بن عبد الله، أخبرنا صدقة بن عبد الرحمن، حدثنا ابن لهيعة، عن مشرح بن هاعان، عن عقبة بن عامر، سمعت رسول الله صلى الله عليه وسلم يقول: لو تمت البقرة ثلاثمائة آية لتكلمت.',
            ];

            const result = findMatches(pages, excerpts);

            expect(result).toEqual([0]);
        });

        it('should match the substring', () => {
            const pages = [
                'بشر بن معاوية البكالي .\nروى عنه يعقوب بن محمد الزهري.\nذكره أبو حاتم.\nمجهول.',
                'بشر بن المنذر قاضى المصيصة.\nقال العقيلي: في حديثه وهم.\nله عن محمد بن مسلم الطائفي.',
                'بشر بن مهران الخصاف.\nعن شريك.\nقال ابن أبي حاتم: ترك أبي حديثه.\nويقال بشير.\nقلت: قد روى عنه محمد بن زكريا الغلابي [لكن الغلابي] متهم.\nقال:\nحدثنا شريك، عن الأعمش، عن زيد بن وهب، عن حذيفة، قال: قال رسول الله صلى الله عليه وسلم: من سره أن يحيا حياتي ويموت ميتتي ويتمسك بالقضيب الياقوت فليتول علي بن أبي طالب من بعدي.',
                'بشر بن ميمون.\nعن القاسم أبى عبد الرحمن.\nوعنه بشر بن المفضل، رحل عابد.\nقواه ابن معين.\nوقال أبو حاتم: أحاديثه منكرة.',
                'بشر بن منصور [ق] .\nشيخ للاشج، يجهل.\nله عن أبي محمد، عن أبي المغيرة، عن ابن عباس - مرفوعا: أبي الله أن يقبل عمل صاحب بدعة.\nفأما: ١٢٢٧ - بشر بن منصور السليمي الزاهد، عن الجريري، وأيوب، وعاصم الأحول، وطائفة - فوثقوه.\nقال القواريري: هو أفضل من رأيت من المشايخ.\nقلت: خرج له مسلم وأبو داود والنسائي.',
                'بشر بن نمير [ق] القشيري البصري .\nعن مكحول، والقاسم ابن عبد الرحمن.\nوعنه أبو عوانة، ويزيد بن زريع، وابن وهب، وطائفة.',
            ];

            const excerpts = [
                'بشر بن مهران الخصاف.\nعن شريك.\nقال ابن أبي حاتم: ترك أبي حديثه.\nويقال بشير.\nقلت: قد روى عنه محمد بن زكريا الغلابي [لكن الغلابي] متهم.\nقال:\nحدثنا شريك، عن الأعمش، عن زيد بن وهب، عن حذيفة، قال: قال رسول الله: من سره أن يحيا حياتي ويموت ميتتي ويتمسك بالقضيب الياقوت فليتول علي بن أبي طالب من بعدي.',
            ];

            const result = findMatches(pages, excerpts);
            expect(result).toEqual([2]);
        });
    });
});
